Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/SUI_ДополнительныеНастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеНастройкиТаблицИнтеграции</name>
  <resources>
    <name>ДанныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_НастройкиМетаданныхСервер/Module.bsl
//@skip-check export-procedure-missing-comment
#Область ПрограммныйИнтерфейс

Функция ПолучитьДополнительныеНастройки(ТаблицаИнтеграции, ТолькоИспользуемые = Истина) Экспорт
	
	ДополнительныеНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьНастройки(ТаблицаИнтеграции, ТолькоИспользуемые);
	
	Если ДополнительныеНастройки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ДополнительныеНастройки[0].ДополнительныеНастройки;
	КонецЕсли;
	
КонецФункции

Процедура СохранитьДополнительныеНастройки(ТаблицаИнтеграции, ДополнительныеНастройки) Экспорт
	
	ДополнительныеНастройкиСоответствие = Новый Соответствие();
	ДополнительныеНастройкиСоответствие.Вставить(ТаблицаИнтеграции, ДополнительныеНастройки);
	
	РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьНастройки(ДополнительныеНастройкиСоответствие);
	
КонецПроцедуры

Процедура УстановитьПризнакИспользованияТаблицы(ТаблицаИнтеграции, Используется, ОчиститьТаблицу = Истина) Экспорт
	
	СоответсвиеКонстант = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеКонстантТаблицИнтеграции();
	Константа = СоответсвиеКонстант.Получить(ТаблицаИнтеграции);
	Если Константа <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗначения = Константа.СоздатьМенеджерЗначения();
		МенеджерЗначения.Значение = Используется;
		Если Не ОчиститьТаблицу Тогда
			МенеджерЗначения.ДополнительныеСвойства.Вставить("SUI_НеОчищатьТаблицу");
		КонецЕсли;
		МенеджерЗначения.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Функция ТаблицаИспользуется(ТаблицаИнтеграции) Экспорт

	ИмяФО = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеФункциональныхОпцийТаблицИнтеграции().Получить(ТаблицаИнтеграции);
	
	Если ИмяФО = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолучитьФункциональнуюОпцию(ИмяФО);
	
КонецФункции

Функция ПолучитьИмяТаблицыВКонфигурации(ТаблицаИнтеграции) Экспорт

	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
	Возврат СоответствиеТаблицИнтеграции.Получить(ТаблицаИнтеграции);

КонецФункции

Функция ПолучитьТаблицуИнтеграцииПоИмениТаблицыКонфигурации(ИмяТаблицыКонфигурации) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
	
	Для Каждого СоответствиеТаблицыИнтеграции Из СоответствиеТаблицИнтеграции Цикл
		Если СоответствиеТаблицыИнтеграции.Значение = ИмяТаблицыКонфигурации Тогда
			НайденноеЗначение = СоответствиеТаблицыИнтеграции.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьТаблицуИнтеграцииПоКонстанте(Константа) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеКонстантТаблицИнтеграции();
	
	Для Каждого СоответствиеТаблицыИнтеграции Из СоответствиеТаблицИнтеграции Цикл
		Если СоответствиеТаблицыИнтеграции.Значение = Константа Тогда
			НайденноеЗначение = СоответствиеТаблицыИнтеграции.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьИмяТаблицыМобильногоУстройства(ТаблицаИнтеграции) Экспорт

	Если ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Тогда
		Возврат "RS_countragents";
	
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Склады Тогда
		Возврат "RS_warehouses";
		
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Возврат "RS_cells";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Тогда
		Возврат "RS_goods";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Возврат "RS_properties";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Тогда
		Возврат "RS_units";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Тогда
		Возврат "RS_classifier_units";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		Возврат "RS_barcodes";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
		Возврат "RS_docs";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Тогда
		Возврат "RS_doc_types";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
		Возврат "RS_employees";
	
	ИначеЕсли ТаблицаИнтеграции = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные() Тогда
		Возврат "RS_docs_completed";
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТаблицаИнтеграции(ПолноеИмяТаблицыКонфигурации) Экспорт
	
	ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграцииВКонфигурации();
	Возврат (ТаблицыИнтеграции.Найти(ПолноеИмяТаблицыКонфигурации) <> Неопределено);
	
КонецФункции

Функция ИмяТаблицыИнтеграции(ТаблицаИнтеграции) Экспорт
	
	ИндексТаблицы = Перечисления.SUI_ТаблицыИнтеграции.Индекс(ТаблицаИнтеграции);
	Возврат Метаданные.Перечисления.SUI_ТаблицыИнтеграции.ЗначенияПеречисления[ИндексТаблицы].Имя;
	
КонецФункции

// Параметры записи настройки.
// 
// Возвращаемое значение:
//  Структура - Структура параметров записи настройки:
Функция ПараметрыЗаписиНастройки() Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	
	ПараметрыЗаписи.Вставить("ТаблицаИнтеграции");
	ПараметрыЗаписи.Вставить("ПолноеИмяОбъекта");
	ПараметрыЗаписи.Вставить("ТаблицаОбъекта");
	ПараметрыЗаписи.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных());
	ПараметрыЗаписи.Вставить("ДополнительныеНастройки", Новый Структура());
	ПараметрыЗаписи.Вставить("Используется");
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыЗаписи;
	
КонецФункции

// Записать настройку.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - см. SUI_НастройкиМетаданныхСервер.ПараметрыЗаписиНастройки.
//@skip-check doc-comment-complex-type-with-link
Процедура ЗаписатьНастройку(ПараметрыЗаписи) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Удалить_SUI_НастройкиТаблицИнтеграции.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи, "ТаблицаИнтеграции, ПолноеИмяОбъекта, ТаблицаОбъекта");
	
	МенеджерЗаписи.НастройкиКомпоновкиДанных = Новый ХранилищеЗначения(ПараметрыЗаписи.НастройкиКомпоновкиДанных, Новый СжатиеДанных(9));
	МенеджерЗаписи.ДополнительныеНастройки = Новый ХранилищеЗначения(ПараметрыЗаписи.ДополнительныеНастройки, Новый СжатиеДанных(9));
	
	МенеджерЗаписи.Записать(Истина);
	
	Если ТипЗнч(ПараметрыЗаписи.Используется) = Тип("Булево") Тогда
		ОчиститьТаблицу = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ОчиститьТаблицу", Истина, Тип("Булево"));
		УстановитьПризнакИспользованияТаблицы(ПараметрыЗаписи.ТаблицаИнтеграции, ПараметрыЗаписи.Используется, ОчиститьТаблицу);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПользовательскийЗапрос() Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	УстановитьПривилегированныйРежим(Истина);
	ДанныеКонструктора = Константы.SUI_ПользовательскийЗапрос.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));
	
	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Возврат Новый ФиксированнаяСтруктура(сткДанныеКонструктора);
	
КонецФункции

Процедура СохранитьПользовательскийЗапрос(ДанныеКонструктора) Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));

	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Константы.SUI_ПользовательскийЗапрос.Установить(
		Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(сткДанныеКонструктора), Новый СжатиеДанных(9)));
	
КонецПроцедуры

Функция ПолучитьЗапросПолученияОстатковИЦен() Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	УстановитьПривилегированныйРежим(Истина);
	ДанныеКонструктора = Константы.SUI_ЗапросПолученияОстатковИЦен.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));
	
	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Возврат Новый ФиксированнаяСтруктура(сткДанныеКонструктора);
	
КонецФункции

Процедура СохранитьЗапросПолученияОстатковИЦен(ДанныеКонструктора) Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));

	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.SUI_ЗапросПолученияОстатковИЦен.Установить(
		Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(сткДанныеКонструктора), Новый СжатиеДанных(9)));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.4.1";
	Обработчик.Процедура 			= "SUI_НастройкиМетаданныхСервер.ОтключениеТаблиц_1_0_4_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Отключение неиспользуемых таблиц интеграций'");
	
КонецПроцедуры

Процедура ОтключениеТаблиц_1_0_4_1() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиТаблицИнтеграции.ТаблицаИнтеграции,
		|	НастройкиТаблицИнтеграции.ИмяОбъектаКонфигурации
		|ИЗ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции КАК НастройкиТаблицИнтеграции
		|ГДЕ
		|	НастройкиТаблицИнтеграции.ТаблицаИнтеграции В (&ОтключаемыеТаблицы)
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции";
	
	Запрос.УстановитьПараметр("ОтключаемыеТаблицы", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры,
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок));
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(Выборка.ТаблицаИнтеграции);
			НаборЗаписей.Отбор.ИмяОбъектаКонфигурации.Установить(Выборка.ИмяОбъектаКонфигурации);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
